In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container {width:100% !important; }</stle>"))

In [10]:
import sqlite3
import pandas as pd
import os

In [6]:
conn = sqlite3.connect("bussssss.db")
conn

In [7]:
#pd.read_sql("QUERY", CONNECTION)
pd.read_sql("SELECT * FROM sqlite_master", conn)

Empty DataFrame
Columns: [type, name, tbl_name, rootpage, sql]
Index: []

In [8]:
conn.close()

In [12]:
path = "bus.db"
assert os.path.exists(path)
conn = sqlite3.connect(path)
conn

In [13]:
pd.read_sql("SELECT * FROM sqlite_master", conn)

,type,name,tbl_name,rootpage,sql
0,table,boarding,boarding,2,"CREATE TABLE ""boarding"" (\n""index"" INTEGER,\n ..."
1,index,ix_boarding_index,boarding,3,"CREATE INDEX ""ix_boarding_index""ON ""boarding"" ..."
2,table,routes,routes,55,"CREATE TABLE ""routes"" (\n""index"" INTEGER,\n ""..."
3,index,ix_routes_index,routes,57,"CREATE INDEX ""ix_routes_index""ON ""routes"" (""in..."

In [14]:
df = pd.read_sql("SELECT * FROM sqlite_master", conn)
df

,type,name,tbl_name,rootpage,sql
0,table,boarding,boarding,2,"CREATE TABLE ""boarding"" (\n""index"" INTEGER,\n ..."
1,index,ix_boarding_index,boarding,3,"CREATE INDEX ""ix_boarding_index""ON ""boarding"" ..."
2,table,routes,routes,55,"CREATE TABLE ""routes"" (\n""index"" INTEGER,\n ""..."
3,index,ix_routes_index,routes,57,"CREATE INDEX ""ix_routes_index""ON ""routes"" (""in..."

In [15]:
df["sql"]

0    CREATE TABLE "boarding" (\n"index" INTEGER,\n ...
1    CREATE INDEX "ix_boarding_index"ON "boarding" ...
2    CREATE TABLE "routes" (\n"index" INTEGER,\n  "...
3    CREATE INDEX "ix_routes_index"ON "routes" ("in...
Name: sql, dtype: object

In [16]:
for code in df["sql"]:
    print(code)

CREATE TABLE "boarding" (
"index" INTEGER,
  "StopID" INTEGER,
  "Route" INTEGER,
  "Lat" REAL,
  "Lon" REAL,
  "DailyBoardings" REAL
)
CREATE INDEX "ix_boarding_index"ON "boarding" ("index")
CREATE TABLE "routes" (
"index" INTEGER,
  "OBJECTID" INTEGER,
  "trips_routes_route_id" INTEGER,
  "route_short_name" INTEGER,
  "route_url" TEXT,
  "ShapeSTLength" REAL
)
CREATE INDEX "ix_routes_index"ON "routes" ("index")

In [18]:
pd.read_sql("SELECT * FROM routes", conn).head()

,index,OBJECTID,trips_routes_route_id,route_short_name,route_url,ShapeSTLength
0,0,63,8052,1,http://www.cityofmadison.com/Metro/schedules/R...,32379.426524
1,1,64,8053,2,http://www.cityofmadison.com/Metro/schedules/R...,96906.965571
2,2,65,8054,3,http://www.cityofmadison.com/Metro/schedules/R...,76436.645644
3,3,66,8055,4,http://www.cityofmadison.com/Metro/schedules/R...,64774.133485
4,4,67,8056,5,http://www.cityofmadison.com/Metro/schedules/R...,61216.722662

In [20]:
pd.read_sql("SELECT * FROM boarding LIMIT 5", conn)

   index  StopID  Route        Lat        Lon  DailyBoardings
0      0    1163     27  43.073655 -89.385427            1.03
1      1    1163     47  43.073655 -89.385427            0.11
2      2    1163     75  43.073655 -89.385427            0.34
3      3    1164      6  43.106465 -89.340021           10.59
4      4    1167      3  43.077867 -89.369993            3.11

In [26]:
# how many people get on a bus in Madison every day
qry = """
    SELECT DailyBoardings 
    FROM boarding
"""
df = pd.read_sql(qry, conn)
bus_riders = df["DailyBoardings"]
bus_riders.sum()

55987.18

In [30]:
# Go West!!! Which bus should i take to go as far west as possible
# Smallest Longitude
qry = """
    SELECT *
    FROM boarding
    ORDER BY Lon ASC
    LIMIT 1
"""
pd.read_sql(qry, conn)

   index  StopID  Route        Lat        Lon  DailyBoardings
0   3489    4400     55  42.995476 -89.564243           59.31

In [31]:
conn.close()